In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.read_csv('/content/train (1).csv')
copy_df=df
copy_df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [3]:
copy_df.shape

(891, 12)

In [4]:
copy_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
x=copy_df.isnull().sum()
drop_col=x[x>(30/100 *df.shape[0])]
drop_col

Cabin    687
dtype: int64

In [6]:
drop_col.index

Index(['Cabin'], dtype='object')

In [7]:
copy_df.drop(drop_col.index,axis=1,inplace=True)
copy_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [8]:
copy_df.fillna(copy_df.mean(),inplace=True)
copy_df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [9]:
copy_df['Embarked'].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

In [11]:
copy_df['Embarked'].head()

0    S
1    C
2    S
3    S
4    S
Name: Embarked, dtype: object

In [12]:
copy_df['Embarked'].fillna('S',inplace=True)
copy_df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [13]:
copy_df.corr()

             PassengerId  Survived    Pclass  ...     SibSp     Parch      Fare
PassengerId     1.000000 -0.005007 -0.035144  ... -0.057527 -0.001652  0.012658
Survived       -0.005007  1.000000 -0.338481  ... -0.035322  0.081629  0.257307
Pclass         -0.035144 -0.338481  1.000000  ...  0.083081  0.018443 -0.549500
Age             0.033207 -0.069809 -0.331339  ... -0.232625 -0.179191  0.091566
SibSp          -0.057527 -0.035322  0.083081  ...  1.000000  0.414838  0.159651
Parch          -0.001652  0.081629  0.018443  ...  0.414838  1.000000  0.216225
Fare            0.012658  0.257307 -0.549500  ...  0.159651  0.216225  1.000000

[7 rows x 7 columns]

In [14]:
copy_df['FamilySize']=df['SibSp']+df['Parch']
copy_df.drop(['SibSp','Parch'],axis=1,inplace=True)
copy_df.corr()

             PassengerId  Survived    Pclass       Age      Fare  FamilySize
PassengerId     1.000000 -0.005007 -0.035144  0.033207  0.012658   -0.040143
Survived       -0.005007  1.000000 -0.338481 -0.069809  0.257307    0.016639
Pclass         -0.035144 -0.338481  1.000000 -0.331339 -0.549500    0.065997
Age             0.033207 -0.069809 -0.331339  1.000000  0.091566   -0.248512
Fare            0.012658  0.257307 -0.549500  0.091566  1.000000    0.217138
FamilySize     -0.040143  0.016639  0.065997 -0.248512  0.217138    1.000000

In [15]:
copy_df.head()

   PassengerId  Survived  Pclass  ...     Fare Embarked  FamilySize
0            1         0       3  ...   7.2500        S           1
1            2         1       1  ...  71.2833        C           1
2            3         1       3  ...   7.9250        S           0
3            4         1       1  ...  53.1000        S           1
4            5         0       3  ...   8.0500        S           0

[5 rows x 10 columns]

In [16]:
copy_df['Alone']=[0 if copy_df['FamilySize'][i]>0 else 1 for i in copy_df.index]
copy_df.head()

   PassengerId  Survived  Pclass  ... Embarked FamilySize  Alone
0            1         0       3  ...        S          1      0
1            2         1       1  ...        C          1      0
2            3         1       3  ...        S          0      1
3            4         1       1  ...        S          1      0
4            5         0       3  ...        S          0      1

[5 rows x 11 columns]

In [17]:
copy_df['New_Sex']=[0 if copy_df['Sex'][i]=='male' else 1 for i in copy_df.index]
copy_df.head()

   PassengerId  Survived  Pclass  ... FamilySize Alone  New_Sex
0            1         0       3  ...          1     0        0
1            2         1       1  ...          1     0        1
2            3         1       3  ...          0     1        1
3            4         1       1  ...          1     0        1
4            5         0       3  ...          0     1        0

[5 rows x 12 columns]

In [18]:
copy_df.groupby(['Alone'])['Survived'].mean()

Alone
0    0.505650
1    0.303538
Name: Survived, dtype: float64

**Conclusion:- Passenger travelling with their family have higher survival rate than others.**

In [19]:
copy_df[['Alone','Fare']].corr()

          Alone      Fare
Alone  1.000000 -0.271832
Fare  -0.271832  1.000000

**Conclusion:- People with high class or rich people have higher survival rate than others.The hierarichy might have been followed while saveing the passengers.**

In [20]:
copy_df.groupby(['New_Sex'])['Survived'].mean()

New_Sex
0    0.188908
1    0.742038
Name: Survived, dtype: float64

**Conclusion:- Female Passengers were prioritized over man.**

In [21]:
copy_df.groupby(['Embarked'])['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.339009
Name: Survived, dtype: float64

**Conclusion :- Passenger who boared the ship at Charbourg survived more in proportion to others.**